2026-04-05-oneness-is-all-you-need.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="UTF-8">
<meta name="description" content="Complexity compounds faster than teams can reason about it. In the LLM era, one source of truth, one obvious path, and one clear place for integrity matter more than ever.">
<link rel="alternate"
      type="application/rss+xml"
      href="https://www.birkey.co/rss.xml"
      title="RSS feed for https://www.birkey.co/">
<title>Oneness is All You Need</title>
<link href="static/style.css" rel="stylesheet" type="text/css" />
	   <link rel="apple-touch-icon" sizes="180x180" href="static/apple-touch-icon.png">
	   <link rel="icon" type="image/png" sizes="32x32" href="static/favicon-32x32.png">
	   <link rel="icon" type="image/png" sizes="16x16" href="static/favicon-16x16.png">
	   <link rel="manifest" href="/site.webmanifest">
	   <link rel="mask-icon" href="static/safari-pinned-tab.svg" color="#5bbad5">
	   <link rel="alternate" type="application/rss+xml" title="RSS Feed for birkey.co" href="/rss.xml">
	   <meta name="author" content="Kasim Tuman">
	   <meta name="referrer" content="no-referrer">
	   <meta name="msapplication-TileColor" content="#da532c">
	   <meta name="theme-color" content="#ffffff">
	   <meta http-equiv="content-type" content="application/xhtml+xml; charset=UTF-8">
	   <meta name="viewport" content="initial-scale=1,width=device-width,minimum-scale=1">
	  </head>
<body>
<div id="preamble" class="status"><br><center>
       <div style="display: inline-block; vertical-align:middle;">
  <a href="https://www.birkey.co/index.html" style="text-decoration: none;"><b>BIRKEY CONSULTING</b><br>
  </a><hr/><div style="text-align: justify;display: inline-block; width: 100%;">
<a class="title" href="https://github.com/oneness">ABOUT</a> &nbsp;<a class="title" href="https://www.birkey.co/rss.xml">RSS</a> &nbsp;<a class="title" href="https://www.birkey.co/archive.html">ARCHIVE</a></div></div>
  </center><br><br>
  <div style="margin-bottom: 3ch;text-transform: none;"></div></div>
<div id="content">
<div class="post-date">05 Apr 2026</div><h1 class="post-title"><a href="https://www.birkey.co/2026-04-05-oneness-is-all-you-need.html">Oneness is All You Need</a></h1>
<p>
Tony Hoare put the problem well when he wrote, "I conclude that there
are two ways of constructing a software design."<sup><a id="fnr.hoare" class="footref" href="#fn.hoare" role="doc-backlink">1</a></sup> One path is
simplicity. The other is complexity, whose deficiencies are harder to
see.
</p>

<p>
That line has stayed with me for years because it names a real danger
in our industry. We often mistake the absence of visible flaws for
actual clarity. We add layers, libraries, frameworks, helper services,
configuration systems, and alternative paths until the whole thing
looks sophisticated enough that nobody can easily challenge it. Then
we call that maturity.
</p>

<p>
In the current era of bloated, fast-generated code, that danger feels
even more immediate. We are producing more software than ever, often
faster than we can understand, verify, or justify. That makes
simplicity less of a preference and more of a survival strategy.
</p>

<p>
Most projects do not fail because engineers lacked yet another abstraction.
They fail because complexity compounds faster than the team can reason
about it. The system becomes harder to inspect, harder to change,
harder to verify, and eventually harder to trust.
</p>

<p>
That is why I keep returning to one design pressure that has become
more important to me over time: oneness.
</p>

<p>
By oneness, I do not mean anything mystical. I mean something very
operational:
</p>
<ul class="org-ul">
<li>one source of truth where possible</li>
<li>one obvious way to do a thing</li>
<li>one clear owner per layer</li>
<li>one logical responsibility per layer</li>
<li>one clear mental model per layer</li>
<li>one place to inspect data integrity</li>
<li>one coherent workflow through the system</li>
</ul>

<p>
The point is not ideological purity. The point is reducing avoidable
complexity so the system stays legible, easily testable, and
verifiable by the people building it.
</p>
<div id="outline-container-orgd107654" class="outline-2">
<h2 id="orgd107654">Why this feels harder than it should</h2>
<div class="outline-text-2" id="text-orgd107654">
<p>
Even before the current LLM era, it was difficult to stay simple.
There were always reasons not to.
</p>

<p>
An engineer wants to move fast, so a new library gets introduced
before its trade-offs are understood. A team wants flexibility, so it
creates multiple ways to achieve the same outcome. A system outgrows
its original design, so validation rules get copied into controllers,
jobs, database constraints, frontend checks, and downstream
consumers. Another team arrives and adds a second workflow rather than
cleaning up the first. Then a third team adds a wrapper around both.
</p>

<p>
Nothing in that sequence sounds absurd in isolation. That is exactly
why complexity is dangerous. It rarely arrives as one obviously wrong
decision. It arrives as a long series of locally reasonable decisions
that collectively destroy clarity.
</p>

<p>
The result is familiar:
</p>
<ul class="org-ul">
<li>New engineers cannot tell where to start.</li>
<li>Existing engineers cannot tell which layer owns what.</li>
<li>Bugs become archaeology.</li>
<li>Data integrity becomes probabilistic.</li>
<li>Every change carries too much fear.</li>
</ul>

<p>
This is why I have long been drawn to ideas like Easy To Change<sup><a id="fnr.etc" class="footref" href="#fn.etc" role="doc-backlink">2</a></sup>,
declarative systems<sup><a id="fnr.nixos" class="footref" href="#fn.nixos" role="doc-backlink">3</a></sup>, self-documenting tools<sup><a id="fnr.selfdoc" class="footref" href="#fn.selfdoc" role="doc-backlink">4</a></sup>, and
a programmable workbench<sup><a id="fnr.workbench" class="footref" href="#fn.workbench" role="doc-backlink">5</a></sup> that
keeps the whole loop visible. They all pull in the same direction.
They reduce multiplicity. They reduce drift. They give you one place
to think from.
</p>
</div>
</div>
<div id="outline-container-org8a194b3" class="outline-2">
<h2 id="org8a194b3">Why the LLM era changes the economics</h2>
<div class="outline-text-2" id="text-org8a194b3">
<p>
The LLM era does not remove this problem. It sharpens it.
</p>

<p>
LLMs lower the cost of producing code. They do not lower the cost of
ambiguity. If they are not harnessed well, they can compound it so
quickly that the resulting system becomes almost impossible to reason
about. That is the danger. The opportunity is that the same tools can
also help us reduce complexity, but only if we use them with
discipline.
</p>

<p>
In fact, ambiguous systems are exactly where generated code becomes
most dangerous. If a repository has three ways to configure a service,
two half-trusted test setups, duplicated validation logic, unclear
module ownership, and no obvious path through the codebase, an agent
will happily generate more material inside that ambiguity. It can
amplify existing confusion faster than a human ever could.
</p>

<p>
But I also think the LLM era gives us an opportunity that did not
exist in quite the same way before. We can now spend less human energy
on producing boilerplate and more human energy on collapsing
unnecessary complexity. An agent can help standardize interfaces,
remove duplicated code paths, migrate scattered logic into one owned
layer, and push a codebase toward a more coherent shape.
</p>

<p>
The principle did not change. The economics did.
</p>

<p>
That is why I do not see the current moment as a reason to compromise
on simplicity. It is one of the first times in my career when I feel I
can insist on it more aggressively.
</p>
</div>
</div>
