2026-04-05-oneness-is-all-you-need.html
<div id="outline-container-org1e83d07" class="outline-2">
<h2 id="org1e83d07">Code is abundant, understanding is not</h2>
<div class="outline-text-2" id="text-org1e83d07">
<p>
SICP says that programs must be written for people to read, and later
adds that readers should know what not to read.<sup><a id="fnr.sicp" class="footref" href="#fn.sicp" role="doc-backlink">6</a></sup>
I still agree with both points, but I think their practical
implication changes in the agentic era.
</p>

<p>
If generated code becomes abundant, it becomes impossible for a human
to read all of it with equal depth. That is not a moral failure. It is
just arithmetic. The surface area grows too quickly.
</p>

<p>
So we need to move one level higher.
</p>

<p>
Instead of assuming the human must read every line with equal care, we
should design systems so the core behavior can be reviewed through a
much smaller surface: tests, invariants, contracts, and executable
examples.
</p>

<p>
I am not claiming tests replace reading code. They do not. Bad tests
can hide bad systems, just as bad abstractions can. But the essence of
a system is often much smaller than its total implementation volume.
</p>

<p>
A team may generate or write a thousand lines of code, but what the
system fundamentally does may fit in:
</p>
<ul class="org-ul">
<li>ten invariants</li>
<li>twenty meaningful examples</li>
<li>a handful of properties</li>
<li>a short list of input/output contracts</li>
</ul>

<p>
That smaller surface is something a human can actually hold in their
head. It is something another engineer can review, an agent can
execute repeatedly, and CI can verify without asking everybody to
reread the entire implementation every time.
</p>

<p>
In other words, the human review surface should get smaller as code
generation gets cheaper.
</p>

<p>
That is not a retreat from engineering rigor. It is an attempt to put
rigor where it gives us the most leverage.
</p>

<p>
In a healthy system, a human reviewer should not need to reread the
entire generated implementation to regain confidence. They should be
able to look at a smaller behavioral surface and ask: Are the
invariants still true? Do the core examples still hold? Did this
change widen the contract or violate it? That is a far more realistic
way to supervise generated code than pretending abundance did not
change the review problem.
</p>
</div>
</div>
<div id="outline-container-orgb60622e" class="outline-2">
<h2 id="orgb60622e">Oneness inside layers</h2>
<div class="outline-text-2" id="text-orgb60622e">
<p>
When I say oneness, I am not arguing against layered systems. I am
arguing that each layer should have one clear responsibility and one
obvious place where certain truths become real.
</p>

<p>
For example:
</p>
<ul class="org-ul">
<li>There should be one place where a piece of data becomes valid.</li>
<li>One place where a business invariant is enforced.</li>
<li>One default command that gets a human or an agent into the project.</li>
<li>One declared artifact that owns environment setup where practical.</li>
<li>One obvious module that owns a transformation.</li>
</ul>

<p>
If the honest answer to those questions is often "it depends," the
system is usually paying a complexity tax already.
</p>

<p>
This is also why I care so much about one source of truth. A scattered
system forces every engineer to rebuild the same mental model from
fragments. A coherent system lets them ask a smaller set of questions,
because the data model and ownership model are clearer. That matters
for humans and for agents too.
</p>

<p>
Sometimes the benefit is almost embarrassingly concrete. One declared
artifact for environment setup is better than shell scripts, wiki
instructions, and CI fragments all telling slightly different stories.
One default project command is better than three nearly equivalent ways
to run tests. One layer owning a business invariant is better than
duplicating partial validation in the UI, the handler, the job runner,
and the database and hoping they never drift apart.
</p>

<p>
Take something as ordinary as order creation. In a messy system, the
shape of an order gets partially validated in the frontend, partially
checked again in the HTTP handler, partially normalized in a background
job, and partially constrained in the database. The tests mirror that
fragmentation, so no single test surface tells you what an order is
supposed to mean. A more coherent design gives one layer ownership of
turning input into a valid order, one place where the invariants become
real, and one test suite that expresses those rules directly. The total
lines of code may not shrink much, but the number of places you need to
look in order to trust the system absolutely does.
</p>

<p>
This is part of why I like tools and conventions that collapse
scattered state into one place. A <code>flake.nix</code><sup><a id="fnr.flakes" class="footref" href="#fn.flakes" role="doc-backlink">7</a></sup> can become
the declared truth for environment setup. A self-documenting
<code>Makefile</code><sup><a id="fnr.makefile" class="footref" href="#fn.makefile" role="doc-backlink">8</a></sup> can become the obvious entry point into a
project. A well-owned test suite can become the smallest trustworthy
surface for reviewing behavioral changes. None of these ideas are
glamorous. That is precisely why they age well.
</p>

<p>
An LLM works much better when there is one obvious command to run, one
obvious directory to modify, one obvious test suite to extend, one
obvious place where integrity checks belong, and one obvious owner for
the relevant behavior. Ambiguity is expensive for humans, and it is
even more expensive when delegated.
</p>
</div>
</div>
<div id="outline-container-orgab921d3" class="outline-2">
<h2 id="orgab921d3">What oneness is not</h2>
<div class="outline-text-2" id="text-orgab921d3">
<p>
Oneness is not:
</p>
<ul class="org-ul">
<li>one giant service</li>
<li>one giant function</li>
<li>one person making all decisions</li>
<li>refusal to use libraries</li>
<li>denial of layering</li>
<li>minimalism for its own sake</li>
</ul>

<p>
It is a bias. It is a design pressure. It says that unnecessary
multiplicity should have to justify itself.
</p>

<p>
Sometimes reality will justify it. There are cases where multiple
paths, multiple representations, or multiple deployment forms are the
right answer. But the burden of proof should be on complexity, not on
simplicity.
</p>

<p>
That is the part our industry often gets backwards.
</p>
</div>
</div>
