2026-04-05-oneness-is-all-you-need.html
<div id="outline-container-orgbcfacdc" class="outline-2">
<h2 id="orgbcfacdc">What I mean in practice</h2>
<div class="outline-text-2" id="text-orgbcfacdc">
<p>
When I look at a system now, especially in the presence of coding
agents, I increasingly want to ask very plain questions:
</p>

<ul class="org-ul">
<li>What is the one thing this layer owns?</li>
<li>What is the one mental model for the data in this layer?</li>
<li>Where is the one place I check whether data is valid?</li>
<li>What is the one command I should run first?</li>
<li>What is the one test file or suite that best expresses intended
behavior?</li>
<li>What is the smallest reviewable surface that captures the essence of
this change?</li>
</ul>

<p>
Those questions do not solve every design problem. But they keep me
oriented toward legibility and verification.
</p>

<p>
And that, to me, is the real opportunity of the LLM era. We can use
these tools to generate more code, yes. But a much better use is to
generate less confusion. We can use them to push systems toward one
obvious path, one owned responsibility, one executable behavioral
surface, and one source of truth where possible.
</p>

<p>
I do not think software becomes better by becoming more clever. I
think it becomes better when it becomes more legible, more
deterministic, and easier to verify.
</p>

<p>
In an era of abundant code, that is what I mean by oneness.
</p>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.hoare" class="footnum" href="#fnr.hoare" role="doc-backlink">1</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
C. A. R. Hoare, <i>The Emperor's Old Clothes</i>, the 1980 ACM Turing Award Lecture, published in <i>Communications of the ACM</i> 24(2), 1981: <a href="https://www.labouseur.com/projects/codeReckon/papers/The-Emperors-Old-Clothes.pdf">https://www.labouseur.com/projects/codeReckon/papers/The-Emperors-Old-Clothes.pdf</a> The "two ways" passage appears on PDF p. 13.
</p></div></div>

<div class="footdef"><sup><a id="fn.etc" class="footnum" href="#fnr.etc" role="doc-backlink">2</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
My earlier post on Easy To Change:
<a href="https://www.birkey.co/2020-12-26-ETC-principle-to-ground-all.html">https://www.birkey.co/2020-12-26-ETC-principle-to-ground-all.html</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.nixos" class="footnum" href="#fnr.nixos" role="doc-backlink">3</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
My post on why declarative systems matter to me:
<a href="https://www.birkey.co/2026-03-22-why-i-love-nixos.html">https://www.birkey.co/2026-03-22-why-i-love-nixos.html</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.selfdoc" class="footnum" href="#fnr.selfdoc" role="doc-backlink">4</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
The GNU Emacs manual describes Emacs as a "self-documenting" editor and explains that this means you can use help commands at any time to find out what your options are and what commands do: <a href="https://www.gnu.org/software/emacs/manual/html_node/emacs/Intro.html">https://www.gnu.org/software/emacs/manual/html_node/emacs/Intro.html</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.workbench" class="footnum" href="#fnr.workbench" role="doc-backlink">5</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
My earlier post on Emacs as a programmable workbench:
<a href="https://www.birkey.co/2026-03-28-emacs-as-a-programmable-workbench.html">https://www.birkey.co/2026-03-28-emacs-as-a-programmable-workbench.html</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.sicp" class="footnum" href="#fnr.sicp" role="doc-backlink">6</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
Harold Abelson and Gerald Jay Sussman, <i>Structure and Interpretation of Computer Programs</i>, Preface to the first edition: <a href="https://sicp.sourceacademy.org/sicpjs.pdf">https://sicp.sourceacademy.org/sicpjs.pdf</a> The readability passage appears on PDF p. 24, including the line about programs being written for people to read and the follow-on point that readers should know what not to read.
</p></div></div>

<div class="footdef"><sup><a id="fn.flakes" class="footnum" href="#fnr.flakes" role="doc-backlink">7</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
Official Nix documentation on flakes:
<a href="https://nix.dev/concepts/flakes.html">https://nix.dev/concepts/flakes.html</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.makefile" class="footnum" href="#fnr.makefile" role="doc-backlink">8</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
My post on self-documenting project entry points:
<a href="https://www.birkey.co/2020-03-05-self-documenting-makefile.html">https://www.birkey.co/2020-03-05-self-documenting-makefile.html</a>
</p></div></div>


</div>
</div><div class="taglist"><a href="https://www.birkey.co/tags.html">Tags</a>: <a href="https://www.birkey.co/tag-engineering.html">engineering</a> <a href="https://www.birkey.co/tag-ai.html">ai</a> </div></div>
<div id="postamble" class="status"><br><center>
	      <div style="display: inline-block; vertical-align:middle;"></div></div>
</body>
</html>
